LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_tldi.c
/**
  ******************************************************************************
  * @file    gd32f20x_tldi.c
  * @author  MCU SD
  * @version V1.0.0
  * @date    15-Jul-2015
  * @brief   TLDI functions of the firmware library..
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "gd32f20x_tldi.h"
#include "gd32f20x_rcc.h"

/** @addtogroup GD32F20x_Firmware
  * @{
  */

/** @defgroup TLDI 
  * @brief TLDI driver modules
  * @{
  */
  
/** @defgroup TLDI_Private_Defines
  * @{
  */

#define CTLR_MASK                     ((uint32_t)0x0FFE888F)  /* TLDI GCR Mask */

/**
  * @}
  */
/** @defgroup TLDI_Private_Functions
  * @{
  */

/**
  * @brief  Reset the TLDI peripheral.
  *         values.
  * @param  None
  * @retval None
  */
void TLDI_DeInit(void)
{
    /* Enable TLDI reset state */
    RCC_APB2Periph2Reset_Enable(RCC_APB2PERIPH2_TLDI, ENABLE);

    /* Release TLDI from reset state */
    RCC_APB2Periph2Reset_Enable(RCC_APB2PERIPH2_TLDI, DISABLE);
}

/**
  * @brief  Initialize the TLDI interface parameters..
  * @note   This function can be used in case that TLDI is disabled.
  * @param  TLDI_Para: pointer to a TLDI_InitPara structure .
  * @retval None
  */
void TLDI_Init(TLDI_InitPara* TLDI_InitParaStruct)
{
    /* Configue Synchronization pluse size */
    TLDI->PSCR &= ~(TLDI_PSCR_VPS  | TLDI_PSCR_HPS);
    TLDI->PSCR |= TLDI_InitParaStruct->TLDI_HSPulseSize<< 16 | 
                      TLDI_InitParaStruct->TLDI_VSPulseSize;

    /* Configue Back porch size */
    TLDI->BPSCR &= ~(TLDI_BPSCR_VBPS  | TLDI_BPSCR_HBPS);
    TLDI->BPSCR |= (TLDI_InitParaStruct->TLDI_HBackPorchSize<< 16 | TLDI_InitParaStruct->TLDI_VBackPorchSize);

    /* Configue Active size */
    TLDI->ASCR &= ~(TLDI_ASCR_VAS| TLDI_ASCR_HAS );
    TLDI->ASCR |= (TLDI_InitParaStruct->TLDI_HActiveSize<< 16 | TLDI_InitParaStruct->TLDI_VActiveSize);

    /* Configue Total size */
    TLDI->TSCR &= ~(TLDI_TSCR_VTS | TLDI_TSCR_HTS );
    TLDI->TSCR |= (TLDI_InitParaStruct->TLDI_HTotalSize<< 16 | TLDI_InitParaStruct->TLDI_VTotalSize);

    TLDI->CTLR &= (uint32_t)CTLR_MASK;
    TLDI->CTLR |=  (uint32_t)(TLDI_InitParaStruct->TLDI_VSPolaritySelect | TLDI_InitParaStruct->TLDI_HSPolaritySelect | \
                           TLDI_InitParaStruct->TLDI_DEPolaritySelect | TLDI_InitParaStruct->TLDI_CLKPolaritySelect);

    /* Configue the background color value */
    TLDI->BVCR &= ~(TLDI_BVCR_BVB  | TLDI_BVCR_BVG| TLDI_BVCR_BVR );
    TLDI->BVCR |= (TLDI_InitParaStruct->TLDI_BackgroundValuegreen << 8 | TLDI_InitParaStruct->TLDI_BackgroundValuered<< 16 |\
                                                                  TLDI_InitParaStruct->TLDI_BackgroundValueBlue);
}

/**
  * @brief  Initialize the sturct TLDI_InitPara.
  * @param  TLDI_InitParaStruct: the sturct TLDI_InitPara pointer.
  * @retval None.
  */
void TLDI_ParaInit(TLDI_InitPara* TLDI_InitParaStruct)
{
    TLDI_InitParaStruct->TLDI_HSPolaritySelect = TLDI_HSPOLARITYSELECT_LOW;      
    TLDI_InitParaStruct->TLDI_VSPolaritySelect = TLDI_VSPOLARITYSELECT_LOW;      
    TLDI_InitParaStruct->TLDI_DEPolaritySelect = TLDI_DEPOLARITYSELECT_LOW;     
    TLDI_InitParaStruct->TLDI_CLKPolaritySelect = TLDI_CLKPOLARITYSELECT_TLDICLOCK;     
    TLDI_InitParaStruct->TLDI_HSPulseSize = 0x00;                
    TLDI_InitParaStruct->TLDI_VSPulseSize = 0x00;                 
    TLDI_InitParaStruct->TLDI_HBackPorchSize = 0x00;               
    TLDI_InitParaStruct->TLDI_VBackPorchSize = 0x00;               
    TLDI_InitParaStruct->TLDI_HActiveSize = 0x00;            
    TLDI_InitParaStruct->TLDI_VActiveSize = 0x00;           
    TLDI_InitParaStruct->TLDI_HTotalSize = 0x00;                    
    TLDI_InitParaStruct->TLDI_VTotalSize = 0x00;                    
    TLDI_InitParaStruct->TLDI_BackgroundValuered = 0x00;            
    TLDI_InitParaStruct->TLDI_BackgroundValuegreen = 0x00;          
    TLDI_InitParaStruct->TLDI_BackgroundValueBlue = 0x00;          
}

/**
  * @brief  Enable or disable the TLDI Controller.
  * @param  NewValue: new state of the TLDI peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TLDI_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        /* Enable TLDI by setting TLDIEN bit */
        TLDI->CTLR |= (uint32_t)TLDI_CTLR_TLDIEN;
    }
    else
    {
        /* Disable TLDI by clearing TLDIEN bit */
        TLDI->CTLR &= ~(uint32_t)TLDI_CTLR_TLDIEN;
    }
}

/**
  * @brief  Enable or disable Dither.
  * @param  NewValue: new state of the Dither.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */

void TLDI_DitherEnable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        /* Enable Dither by setting DEN bit */
        TLDI->CTLR |= (uint32_t)TLDI_CTLR_DEN;
    }
    else
    {
        /* Disable Dither by clearing DEN bit */
        TLDI->CTLR &= ~(uint32_t)TLDI_CTLR_DEN;
    }
}

/**
  * @brief  Get the dither color bit value.
  * @param  None.
  * @retval None
  */
TLDI_Color_InitPara TLDI_GetDitherColorBits(void)
{
    TLDI_Color_InitPara DitherColor_BitsParaStruct;

    TLDI->CTLR &= (uint32_t)CTLR_MASK;

    DitherColor_BitsParaStruct.BlueValue = (uint32_t)((TLDI->CTLR >> 4) & 0x7);
    DitherColor_BitsParaStruct.GreenValue = (uint32_t)((TLDI->CTLR >> 8) & 0x7);
    DitherColor_BitsParaStruct.RedValue = (uint32_t)((TLDI->CTLR >> 12) & 0x7);

    return DitherColor_BitsParaStruct;
}

/**
  * @brief  Initialize the sturct TLDI_Color_InitPara.
  * @param  Color_InitParaStruct: the sturct TLDI_Color_InitPara pointer.
  * @retval None.
  */
void TLDI_ColorParaInit(TLDI_Color_InitPara* Color_InitParaStruct)
{
    Color_InitParaStruct->BlueValue = 0x02;
    Color_InitParaStruct->GreenValue = 0x02;
    Color_InitParaStruct->RedValue = 0x02;
}

/**
  * @brief  Define the position of the line reach .
  * @param  TLDI_LRPositionConfig: Line reach position.
  * @retval None
  */
void TLDI_LineReachPosConfig(uint32_t TLDI_LRPositionConfig)
{
  /* Set the Line Interrupt position */
  TLDI->LRFR = (uint32_t)TLDI_LRPositionConfig;
}

/**
  * @brief  reload layers registers with new parameters 
  * @param  TLDI_ReloadLayerType: specifies the type of reload.
  *   This parameter can be one of the following values:
  *     @arg TLDI_RELOADLAYERTYPE_FBR: Vertical blanking reload.
  *     @arg TLDI_RELOADLAYERTYPE_RQR: Immediate reload.  
  * @retval None
  */
void TLDI_ReloadConfig(uint32_t TLDI_ReloadLayerType)
{
    /* Set the Reload type */
    TLDI->RLCR = (uint32_t)TLDI_ReloadLayerType;
}


/**
  * @brief  Initialize the TLDI Layer on the base of  the specified parameters
  *         in the TLDI_Layer_InitParaStruct.
  * @note   This function can be used in case that the TLDI is disabled.
  * @param  TLDI_layerx: configures the layer to be initialized, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2    
  * @param   pointer to a Layer_InitPara structure .
  * @retval None
  */
void TLDI_LayerInit(TLDI_Layer_TypeDef* TLDI_Layerx, TLDI_Layer_InitPara* Layer_InitParaStruct)
{
    /* Configure the horizontal start and stop position */
    TLDI_Layerx->HWCR &= ~(TLDI_LxHWCR_WRP | TLDI_LxHWCR_WLP);
    TLDI_Layerx->HWCR = (Layer_InitParaStruct->Layer_WindowRightPos | \
                       Layer_InitParaStruct->Layer_WindowLeftPos << 16);

    /* Configure the vertical start and stop position */
    TLDI_Layerx->VWCR &= ~(TLDI_LxVWCR_WBP | TLDI_LxVWCR_WTP );
    TLDI_Layerx->VWCR  = (Layer_InitParaStruct->Layer_WindowBottomPos | \
                         Layer_InitParaStruct->Layer_WindowTopPos << 16);

    /* Specify the pixel format */
    TLDI_Layerx->PFR &= ~(TLDI_LxPFR_PF );
    TLDI_Layerx->PFR = (Layer_InitParaStruct->Layer_PixelFormat);

    /* Configure the default color values */
    TLDI_Layerx->DCR &=  ~(TLDI_LxDCR_DCB | TLDI_LxDCR_DCG | TLDI_LxDCR_DCR | TLDI_LxDCR_DCA);
    TLDI_Layerx->DCR = (Layer_InitParaStruct->Layer_DefaultColorBlue | \
                      Layer_InitParaStruct->Layer_DefaultColorGreen<< 8  | \
                      Layer_InitParaStruct->Layer_DefaultColorRed<< 16  | \
                      Layer_InitParaStruct->Layer_DefaultColorAlpha<< 24  );

