LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_tldi.c
    /* Specified alpha value */      
    TLDI_Layerx->SAR &= ~(TLDI_LxSAR_SALPHA );
    TLDI_Layerx->SAR = (Layer_InitParaStruct->Layer_SpecifiedAlpha);

    /* Specify the blending factors */
    TLDI_Layerx->BMR &= ~(TLDI_LxBMR_ACM2 | TLDI_LxBMR_ACM1 );
    TLDI_Layerx->BMR = (Layer_InitParaStruct->Layer_ACM_BlendingFactor_1 | Layer_InitParaStruct->Layer_ACM_BlendingFactor_2);

    /* Configure the color frame buffer start address */
    TLDI_Layerx->FBSAR &= ~(TLDI_LxFBSAR_FBSA);
    TLDI_Layerx->FBSAR = (Layer_InitParaStruct->Layer_FrameBufferStartAddress);

    /* Configure the color frame buffer pitch in byte */
    TLDI_Layerx->FBLR  &= ~(TLDI_LxFBLR_FBL | TLDI_LxFBLR_FBOFFSET);
    TLDI_Layerx->FBLR  = (Layer_InitParaStruct->Layer_FrameBufferLength |\
                          Layer_InitParaStruct->Layer_FrameBufferOffset<< 16);

    /* Configure the frame buffer line number */
    TLDI_Layerx->FBLNR  &= ~(TLDI_LxFBLNR_FBLN );
    TLDI_Layerx->FBLNR  = (Layer_InitParaStruct->Layer_FrameBufferLineNumber);

}

/**
  * @brief  Initialize the sturct TLDI_Layer_InitPara.
  * @param  Layer_InitParaStruct: the sturct TLDI_Layer_InitPara pointer.
  * @retval None.
  */
void TLDI_LayerParaInit(TLDI_Layer_InitPara * Layer_InitParaStruct)
{

    /*!< Initialize the WindowrightPos and WindowLeftPos member */
    Layer_InitParaStruct->Layer_WindowRightPos = 0x00;
    Layer_InitParaStruct->Layer_WindowLeftPos = 0x00;

    /*!< Initialize the WindowBottomPos and WindowTopPos member */
    Layer_InitParaStruct->Layer_WindowBottomPos = 0x00;
    Layer_InitParaStruct->Layer_WindowTopPos = 0x00;

    /*!< Initialize PixelFormat member */
    Layer_InitParaStruct->Layer_PixelFormat = PF_ARGB8888;

    /*!< Initialize SpecifiedAlpha member */
    Layer_InitParaStruct->Layer_SpecifiedAlpha = 0xFF;

    /*!< Initialize the default color values */
    Layer_InitParaStruct->Layer_DefaultColorBlue = 0x00;
    Layer_InitParaStruct->Layer_DefaultColorGreen = 0x00;
    Layer_InitParaStruct->Layer_DefaultColorRed = 0x00;
    Layer_InitParaStruct->Layer_DefaultColorAlpha = 0x00;

    /*!< Initialize the ACM blending factors */
    Layer_InitParaStruct->Layer_ACM_BlendingFactor_1 = LAYER_ACM_BLENDINGFACTOR_1_SAPA;
    Layer_InitParaStruct->Layer_ACM_BlendingFactor_2 = LAYER_ACM_BLENDINGFACTOR_2_SAPA;

    /*!< Initialize the frame buffer start address */
    Layer_InitParaStruct->Layer_FrameBufferStartAddress = 0x00;

    /*!< Initialize the frame buffer length and offset */
    Layer_InitParaStruct->Layer_FrameBufferLength = 0x00;
    Layer_InitParaStruct->Layer_FrameBufferOffset = 0x00;

    /*!< Initialize the frame buffer line number */
    Layer_InitParaStruct->Layer_FrameBufferLineNumber = 0x00;
}


/**
  * @brief  Enable or disable the TLDI_Layer Controller.
  * @param  TLDI_layerx: configures layer to be enabled, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2
  * @param  NewValue: new state of the TLDI_Layer peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TLDI_Layer_Enable(TLDI_Layer_TypeDef* TLDI_Layerx, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
    /* Enable TLDI_Layer by setting LEN bit */
    TLDI_Layerx->CTLR |= (uint32_t)TLDI_LxCTLR_LEN;
    }
    else
    {
    /* Disable TLDI_Layer by clearing LEN bit */
    TLDI_Layerx->CTLR &= ~(uint32_t)TLDI_LxCTLR_LEN;
    }
}


/**
  * @brief  Attain the current position.
  * @param  None.
  * @retval None
  */
TLDI_Pixel_CurrentPosition TLDI_GetCurrentPos(void)
{
    TLDI_Pixel_CurrentPosition Pixel_CurrentPositionStruct;

    TLDI->CPPR &= ~(TLDI_CPPR_VPOS | TLDI_CPPR_HPOS);

    Pixel_CurrentPositionStruct.Current_HorPosition = (uint32_t)(TLDI->CPPR >> 16);
    Pixel_CurrentPositionStruct.Current_VerPosition = (uint32_t)(TLDI->CPPR & 0xFFFF);

    return Pixel_CurrentPositionStruct;
}

/**
  * @brief  Initialize the sturct Pixel_CurrentPosition.
  * @param  Pixel_CurrentPositionStruct: the sturct Pixel_CurrentPosition pointer.
  * @retval None.
  */
void TLDI_PosParaInit(TLDI_Pixel_CurrentPosition* Pixel_CurrentPositionStruct)
{
    Pixel_CurrentPositionStruct->Current_HorPosition = 0x00;
    Pixel_CurrentPositionStruct->Current_VerPosition = 0x00;
}

/**
  * @brief  Check whether the specified flag of TLDI is set or not.
  * @param  TLDI_CIS: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg TLDI_CISR_VDE: vertical data enable current status.
  *     @arg TLDI_CISR_HDE: horizontal data enable current status.
  *     @arg TLDI_CISR_VS:  Vertical Synchronization current status.
  *     @arg TLDI_CISR_HS:  Horizontal Synchronization current status.
  * @retval The new state of TLDI_CIS (SET or RESET).
  */
TypeState TLDI_GetCurInterfaceState(uint32_t TLDI_CIS)
{
    if ((TLDI->CISR & TLDI_CIS) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }

}

/**
  * @brief  Configure the color keying.
  * @param  ColorKey_InitParaStruct: pointer to TLDI_ColorKey_InitPara structure. 
  * @param  TLDI_layerx: Select the layer to be configured.
       This parameter can be one of the following values: TLDI_Layer1, TLDI_Layer2   
  * @param  NewValue:This parameter can be ENABLE or DISABLE
  * @retval None
  */

void TLDI_ColorKeyingConfig(TLDI_Layer_TypeDef* TLDI_Layerx, TLDI_ColorKey_InitPara* ColorKey_InitParaStruct, TypeState NewState)
{   
    if (NewState != DISABLE)
    {
        /* Enable TLDI color keying by setting COKYEN bit */
        TLDI_Layerx->CTLR |= (uint32_t)TLDI_LxCTLR_COKYEN;

        /* Set the color keying values */
        TLDI_Layerx->CKVR  &= ~(TLDI_LxCKVR_CKB | TLDI_LxCKVR_CKG | TLDI_LxCKVR_CKR);
        TLDI_Layerx->CKVR |= (ColorKey_InitParaStruct->ColorKey_Blue | ColorKey_InitParaStruct->ColorKey_Green << 8 | \
                              ColorKey_InitParaStruct->ColorKey_Red << 16);
    }
    else
    {
        /* Disable TLDI color keying by clearing COKYEN bit */
        TLDI_Layerx->CTLR &= ~(uint32_t)TLDI_LxCTLR_COKYEN;
    }
    /* Reload shadow register */
    TLDI->RLCR = TLDI_RELOADLAYERTYPE_RQR;
}

/**
  * @brief  Attach each TLDI_ColorKey_InitPara member to its default value.
  * @param  ColorKey_InitParaStruct:pointer to a TLDI_ColorKey_InitPara structure .
  * @retval None
  */
void TLDI_ColorKeyingParaInit(TLDI_ColorKey_InitPara* ColorKey_InitParaStruct)
{
    /*!< Initialize the color keying values */
    ColorKey_InitParaStruct->ColorKey_Blue = 0x00;
    ColorKey_InitParaStruct->ColorKey_Green = 0x00;
    ColorKey_InitParaStruct->ColorKey_Red = 0x00;
}


/**
  * @brief  Enable or disables LUT.
  * @param  NewState: new state of LUT.
  * @param  TLDI_layerx: Selects the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2  
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TLDI_LUT_Enable(TLDI_Layer_TypeDef* TLDI_Layerx, TypeState NewState)
{
    if (NewState != DISABLE)
    {
        /* Enable CLUT by setting LUTEN bit */
        TLDI_Layerx->CTLR |= (uint32_t)TLDI_LxCTLR_LUTEN;
    }
    else
    {
        /* Disable CLUT by clearing LUTEN bit */
        TLDI_Layerx->CTLR &= ~(uint32_t)TLDI_LxCTLR_LUTEN;
    }
    /* Reload shadow register */
    TLDI->RLCR = TLDI_RELOADLAYERTYPE_RQR;
}

/**
  * @brief  Initializes the LUT.
  * @param  LUT_InitParaStruct:pointer to a TLDI_LUT_InitPara structure .
  * @param  TLDI_layerx: Select the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2   
  * @retval None
  */
void TLDI_LUTInit(TLDI_Layer_TypeDef* TLDI_Layerx, TLDI_LUT_InitPara* LUT_InitParaStruct)
{     
    /* Specifies the CLUT address and RGB value */
    TLDI_Layerx->LUTWR  = (LUT_InitParaStruct->LUT_BlueValue | \
                         LUT_InitParaStruct->LUT_GreenValue << 8 | \
                         LUT_InitParaStruct->LUT_RedValue << 16| \
                         LUT_InitParaStruct->LUT_Adress << 24 );
}

/**
  * @brief  Attaches each TLDI_LUT_InitPara member to its default value.
  * @param  LUT_InitParaStruct:pointer to a TLDI_LUT_InitPara structure .
  * @retval None
  */
void TLDI_LUTParaInit(TLDI_LUT_InitPara* LUT_InitParaStruct)
{
    /*!< Initialize the LUT address and RGB values */
    LUT_InitParaStruct->LUT_Adress = 0x00;
    LUT_InitParaStruct->LUT_BlueValue = 0x00;
    LUT_InitParaStruct->LUT_GreenValue = 0x00;
    LUT_InitParaStruct->LUT_RedValue = 0x00;
}


/**
  * @brief  Reconfigure the layer position.
  * @param  OffsetX: horizontal offset .
  * @param  OffsetY: vertical offset .   
  * @param  TLDI_layerx: Select the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2   
  * @retval Reload of the shadow registers values must be applied in case that layer 
  *         position reconfiguration.
  */
void TLDI_LayerPosition(TLDI_Layer_TypeDef* TLDI_Layerx, uint16_t OffsetX, uint16_t OffsetY)
{  
    uint32_t tempreg, temp;
    uint32_t horizontal_start;
    uint32_t horizontal_stop;
    uint32_t vertical_start;
    uint32_t vertical_stop;

    TLDI_Layerx->HWCR &= ~(TLDI_LxHWCR_WRP | TLDI_LxHWCR_WLP);
    TLDI_Layerx->VWCR &= ~(TLDI_LxVWCR_WBP | TLDI_LxVWCR_WTP);

