LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_tldi.c
    /* Reconfigures the horizontal and vertical start position */
    tempreg = TLDI->BPSCR;
    horizontal_start = (tempreg >> 16) + 1 + OffsetX;
    vertical_start = (tempreg & 0xFFFF) + 1 + OffsetY;

    /* Reconfigures the horizontal and vertical stop position */
    /* Get the number of byte per pixel */

    tempreg = TLDI_Layerx->PFR;

    if (tempreg == PF_ARGB8888)
    {
        temp = 4;
    }
    else if (tempreg == PF_RGB888)
    {
        temp = 3;
    }
    else if ((tempreg == PF_ARGB4444) || 
          (tempreg == PF_RGB565)    ||  
          (tempreg == PF_ARGB1555)  ||
          (tempreg == PF_AL88))
    {
        temp = 2;  
    }
    else
    {
        temp = 1;
    }  

    tempreg = TLDI_Layerx->FBLR;
    horizontal_stop = (((tempreg & 0x1FFF) - 3)/temp) + horizontal_start - 1;

    tempreg = TLDI_Layerx->FBLNR;
    vertical_stop = (tempreg & 0x7FF) + vertical_start - 1;  

    TLDI_Layerx->HWCR = horizontal_start | (horizontal_stop << 16);
    TLDI_Layerx->VWCR = vertical_start | (vertical_stop << 16);  
}
  
/**
  * @brief  Reconfigure alpha.
  * @param  ConstantAlpha:constant alpha value.
  * @param  TLDI_layerx: Select the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2    
  * @retval Reload of the shadow registers values must be applied depending on constant 
  *         alpha reconfiguration.         
  */
void TLDI_LayerAlpha(TLDI_Layer_TypeDef* TLDI_Layerx, uint8_t Alpha)
{  
    /* reconfigure the constant alpha value */      
    TLDI_Layerx->SAR = Alpha;
}

/**
  * @brief  Reconfigure layer address.
  * @param  Address:The color frame buffer start address.
  * @param  TLDI_layerx: Select the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2     
  * @retval Reload of the shadow registers values must be applied depending on layer 
  *         address reconfiguration.
  */
void TLDI_LayerAddress(TLDI_Layer_TypeDef* TLDI_Layerx, uint32_t Address)
{
    /* Reconfigures the color frame buffer start address */
    TLDI_Layerx->FBSAR = Address;
}
  
/**
  * @brief  Reconfigure layer size.
  * @param  Width: layer window width.
  * @param  Height: layer window height.   
  * @param  TLDI_layerx: Select the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2   
  * @retval Reload of the shadow registers values must be applied depending on layer 
  *         size reconfiguration.
  */
void TLDI_LayerSize(TLDI_Layer_TypeDef* TLDI_Layerx, uint32_t Width, uint32_t Height)
{
    uint8_t temp;
    uint32_t tempreg;
    uint32_t horizontal_start;
    uint32_t horizontal_stop;
    uint32_t vertical_start;
    uint32_t vertical_stop;  

    tempreg = TLDI_Layerx->PFR;

    if (tempreg == PF_ARGB8888)
    {
    temp = 4;
    }
    else if (tempreg == PF_RGB888)
    {
    temp = 3;
    }
    else if ((tempreg == PF_ARGB4444) || \
          (tempreg == PF_RGB565)    || \
          (tempreg == PF_ARGB1555)  || \
          (tempreg == PF_AL88))
    {
    temp = 2;  
    }
    else
    {
    temp = 1;
    }

    /* update horizontal and vertical stop */
    tempreg = TLDI_Layerx->HWCR;
    horizontal_start = (tempreg & 0x1FFF);
    horizontal_stop = Width + horizontal_start - 1;  

    tempreg = TLDI_Layerx->VWCR;
    vertical_start = (tempreg & 0x1FFF);
    vertical_stop = Height + vertical_start - 1;  

    TLDI_Layerx->HWCR = horizontal_start | (horizontal_stop << 16);
    TLDI_Layerx->VWCR = vertical_start | (vertical_stop << 16);  

    /* Reconfigures the color frame buffer pitch in byte */
    TLDI_Layerx->FBLR  = ((Width * temp) << 16) | ((Width * temp) + 3);  

    /* Reconfigures the frame buffer line number */
    TLDI_Layerx->FBLNR  = Height;  
}

/**
  * @brief  Reconfigure layer pixel format.
  * @param  PixelFormat: reconfigures the pixel format.   
  * @param  TLDI_layerx: Select the layer to be configured, this parameter can be 
  *         one of the following values: TLDI_Layer1, TLDI_Layer2   
  * @retval Reloads of the shadow registers values must be applied depending on layer 
  *         pixel format reconfiguration.
  */
void TLDI_LayerPixelFormat(TLDI_Layer_TypeDef* TLDI_Layerx, uint32_t PixelFormat)
{
    uint8_t temp;
    uint32_t tempreg;

    tempreg = TLDI_Layerx->PFR;

    if (tempreg == PF_ARGB8888)
    {
        temp = 4;
    }
    else if (tempreg == PF_RGB888)
    {
        temp = 3;
    }
    else if ((tempreg == PF_ARGB4444) || \
          (tempreg == PF_RGB565)    || \
          (tempreg == PF_ARGB1555)  || \
          (tempreg == PF_AL88))  
    {
        temp = 2;  
    }
    else
    {
        temp = 1;
    }

    tempreg = (TLDI_Layerx->FBLR >> 16);
    tempreg = (tempreg / temp); 

    if (PixelFormat == PF_ARGB8888)
    {
        temp = 4;
    }
    else if (PixelFormat == PF_RGB888)
    {
        temp = 3;
    }
    else if ((PixelFormat == PF_ARGB4444) || \
          (PixelFormat == PF_RGB565)    || \
          (PixelFormat == PF_ARGB1555)  || \
          (PixelFormat == PF_AL88))
    {
        temp = 2;  
    }
    else
    {
        temp = 1;
    }

    /* Reconfigures the color frame buffer pitch in byte */
    TLDI_Layerx->FBLR  = ((tempreg * temp) << 16) | ((tempreg * temp) + 3);  

    /* Reconfigures the color frame buffer start address */
    TLDI_Layerx->PFR = PixelFormat;

}
    

/**
  * @brief  Enable or disable TLDI nterrupts.
  * @param  TLDI_INT: specifies the TLDI interrupts sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg TLDI_INT_CRIM
  *     @arg TLDI_INT_FEIM
  *     @arg TLDI_INT_TEIM
  *     @arg TLDI_INT_LRIM  
  * @param NewState: This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TLDI_INTConfig(uint32_t TLDI_INT, TypeState NewState)
{
    if (NewState != DISABLE)
    {
        TLDI->IMR |= TLDI_INT;
    }
    else
    {
        TLDI->IMR &= (uint32_t)~TLDI_INT;
    }
}

/**
  * @brief  Detect the interrupt bit flag.
  * @param  TLDI_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg TLDI_FLAG_LR:    Line Interrupt flag.
  *     @arg TLDI_FLAG_FE:   FIFO Underrun Interrupt flag.
  *     @arg TLDI_FLAG_TE: Transfer Error Interrupt flag.
  *     @arg TLDI_FLAG_CLR:   Register Reload interrupt flag.
  * @retval The new state of TLDI_FLAG (SET or RESET).
  */
TypeState TLDI_GetBitState(uint32_t TLDI_FLAG)
{
    if ((TLDI->STR & TLDI_FLAG) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }

