LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_tldi.c
}

/**
  * @brief  Clear the TLDI flags.
  * @param  TLDI_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg TLDI_FLAG_LR:    Line Interrupt flag.
  *     @arg TLDI_FLAG_FE:   FIFO Underrun Interrupt flag.
  *     @arg TLDI_FLAG_TE: Transfer Error Interrupt flag.
  *     @arg TLDI_FLAG_CLR:   Register Reload interrupt flag.
  * @retval None
  */
void TLDI_ClearBitState(uint32_t TLDI_FLAG)
{
    /* Clear the corresponding TLDI flag */
    TLDI->CFR = (uint32_t)TLDI_FLAG;
}

/**
  * @brief  Check whether the specified TLDI's interrupt has occurred or not.
  * @param  TLDI_INT: specifies the TLDI interrupts sources to check.
  *   This parameter can be one of the following values:
  *     @arg TLDI_INT_CRIM
  *     @arg TLDI_INT_FEIM
  *     @arg TLDI_INT_TEIM
  *     @arg TLDI_INT_LRIM  
  * @retval The new state of the TLDI_IT (SET or RESET).
  */
TypeState TLDI_GetIntState(uint32_t TLDI_INT)
{
    TypeState bitstatus = RESET;

    if ((TLDI->STR & TLDI_INT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    if (((TLDI->IMR & TLDI_INT) != (uint32_t)RESET) && (bitstatus != (uint32_t)RESET))
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}


/**
  * @brief  Clear the TLDI interrupt bit.
  * @param  TLDI_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg TLDI_INT_CRIM
  *     @arg TLDI_INT_FEIM
  *     @arg TLDI_INT_TEIM
  *     @arg TLDI_INT_LRIM  
  * @retval None
  */
void TLDI_ClearIntBitState(uint32_t TLDI_INT)
{
    /* Clear the corresponding TLDI Interrupt */
    TLDI->CFR = (uint32_t)TLDI_INT;
}
/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */ 



/******************* (C) COPYRIGHT 2015 GIGADEVICE *****END OF FILE****/
